## Освітня Модель v1.1

## Гуманітарний бік валідування
1. Вступ до валідування (лекція) | [Презентація #1](https://docs.google.com/presentation/d/1G4xYzSRIbekbuZZS6R0zuG8RNeOFxOLWGpfMyxq-sQM/edit?usp=sharing)
2. Структури, що не потребують дозволу на участь, Консенсус у блокчейні та Консенсус між людьми (лекція) | [Презентація #2](https://docs.google.com/presentation/d/1t1hU1tZ9s0WEkygSo54Nx4vrGc1Btdo7eM3RFVnIvcE/edit?usp=sharing)
3. Як не загубитися на тлі інших: упаковка валідатора (лекція) | [Презентація #3](https://docs.google.com/presentation/d/1LFPC8iEKzoB62QVLcyWrVcOddchtPlnFTTpcYu1bFrU/edit?usp=sharing)
4. Як обрати яку мережу валідувати? (лекція-семінар)
5. Яку користь може принести валідатор Мережі, крім безпеки? (лекція-семінар)
6. Як спілкуватися з творцями проєкту та іншими валідаторами? (лекція-семінар)

## Технічний бік валідування
1. Знайомство з Лінукс і документацією Cosmos SDK (семінар-воркшоп) | [Презентація #1](https://bit.ly/38du44V)
2. Що необхідно для валідуванняия? (семінар-лекція) | [Презентація #2](https://bit.ly/2Xza4Yl)
3. Кібер-безпека (семінар-воркшоп) | [Презентація #3](https://bit.ly/3jlwAfE)
4. Спілкуємось з блокчейном (семінар-воркшоп) | [Табличка-Шпаргалка](https://docs.google.com/spreadsheets/d/1haiuoi_TS8iYhEa9F2satd1MeXigiWiD07pY9Ir6LK4/edit?usp=sharing)

## Практичний бік валідування
1. Обираємо мережу для валідування 
2. Запуск валідатора 
3. Оновлення валідатора 
4. Розбираємося з GitHub 
5. Створюємо сторінку валідатора

### Додаткові заняття

1. Розміщення смарт-контрактів на Juno Network: [Частина 1 - підготовка](https://youtu.be/xjGj8PIkrKU) | [Частина 2 - розміщення](https://youtu.be/SuPByXkjbKk)
